{
  "CELL WALL": "It is a rigid, protective layer found outside the cell membrane in plant cells, fungi, bacteria, algae, and some archaea.",
  "DNA": "The sequence of these bases encodes genetic information, which determines an organism's traits and functions.",
  "FLAGELLA": "They are long, whip-like structures that extend from the surface of certain cells, enabling them to move.",
  "MITOSIS": "It is a type of cell division that results in two genetically identical daughter cells from a single parent cell.",
  "CYTOSOL": "It is the liquid component of the cytoplasm in a cell, where various cellular processes take place.",
  "VACUOLE": "It is a membrane-bound organelle found in the cytoplasm of plant and fungal cells, as well as some protists and animal cells.",
  "CENTRIOLE": "It is a cylindrical cell structure found in animal cells that plays a crucial role in cell division.",
  "MICROTUBULE": "They are structural components of the cytoskeleton in eukaryotic cells.",
  "SECRETORY VESICLE": "It is a small, membrane-bound sac found in cells that stores and transports substances to be secreted from the cell.",
  "CHLOROPHYLL": "It is a green pigment found in plants, algae, and cyanobacteria that is essential for photosynthesis, the process by which plants convert light energy into chemical energy.",
  "ORGANELLE": "It is a specialized structure within a cell that performs a specific function.",
  "NUCLEAR ENVELOPE": "It is a double membrane structure that surrounds the nucleus in eukaryotic cells.",
  "CISTERNA": "It is a container or tank used to collect and store water or other liquids.",
  "CRISTAE": "They are folds or projections found in the inner membrane of mitochondria.",
  "PROTEIN": "They are large, complex molecules made up of chains of amino acids.",
  "LIPIDS": "They are a diverse group of organic compounds that are insoluble in water but soluble in nonpolar solvents like fats and oils.",
  "CILIA": "They are tiny, hair-like structures on the surface of many cells.",
  "ECTOPLASM": "It is the outer, more gel-like part of the cytoplasm, found just beneath the cell membrane. It provides structural support and helps in cellular movement and shape.",
  "ENDOPLASM": "It is the inner, more fluid part of the cytoplasm, located between the cell membrane and the nucleus. It is involved in the movement and nutrient transport.",
  "CYTOPLASM": "It is the gel-like substance within a cell membrane that contains organelles, cytosol, and various inclusions. It helps in the movement of materials within the cell. ",
  "SUGAR": "They are simple carbohydrates that serve as a primary source of energy for cells.",
  "ATP": "It is a molecule that serves as the primary energy carrier in cells. It stores and transfers energy needed for various cellular processes.",
  "CELL MEMBRANE": "It is a lipid bilayer with embedded proteins that surrounds and protects the cell. It regulates the movement of substances in and out of the cell",
  "NUCLEOLUS": "It is a dense, spherical structure within the nucleus of eukaryotic cells. It is primarily responsible for the synthesis and assembly of ribosomal RNA (rRNA).",
  "NUCLEAR PORES": "They are large protein complexes embedded in the nuclear envelope, which separates the nucleus from the cytoplasm in eukaryotic cells.",
  "NUCLEAR MEMBRANE": "It is a double-layered membrane that surrounds the nucleus in eukaryotic cells. It separates the nucleus from the cytoplasm and regulates the exchange of materials between the nucleus and the rest of the cell through nuclear pores.",
  "NUCLEUS": "It is the membrane-bound organelle that contains the cell's genetic material (DNA) and is responsible for regulating various cellular activities, including growth, metabolism, and reproduction.",
  "LYSOSOME": "They are membrane-bound organelles found in eukaryotic cells that contain digestive enzymes. They are responsible for breaking down and recycling various biomolecules, such as proteins and lipids, as well as cellular waste and damaged organelles.",
  "MITOCHONDRION": "It is a membrane-bound organelle found in the cytoplasm of eukaryotic cells. Often referred to as the powerhouse of the cell, they generate most of the cell's supply of ATP",
  "RIBOSOME": "It is an intercellular structure made of both RNA and protein, and it is the site of protein synthesis in the cell. They read the messenger RNA (mRNA) sequence and translates that genetic code into a specified string of amino acids.",
  "ENDOPLASMIC RETICULUM": "It is an extensive network of membrane-bound tubules and sacs within eukaryotic cells. It comes in two forms: smooth and rough.",
  "GOLGI BODIES": "They are membrane-bound organelles in eukaryotic cells responsible for modifying, sorting, and packaging proteins and lipids synthesized in the endoplasmic reticulum (ER).",
  "Chromosomes ": "They are thread-like structures located within the nucleus of eukaryotic cells that are composed of DNA and proteins. They carry genetic information in the form of genes.",
  "RNA": "It is a molecule essential for various biological functions. It acts as a messenger carrying instructions from DNA for controlling the synthesis of proteins, and it can also play roles in gene regulation and catalysis."
}