{
  "CELL": "The basic unit of life. It is surrounded by a cell membrane and contains various organelles that perform specific functions.",
  "NUCLEUS": "The control center of the cell. It contains the cell's DNA, which is responsible for hereditary information.",
  "NUCLEAR MEMBRANE": "A double-layered membrane that surrounds the nucleus and separates it from the cytoplasm.",
  "NUCLEAR PORES": "Tiny holes in the nuclear membrane that allow certain molecules to pass in and out of the nucleus.",
  "NUCLEOLUS": "A region within the nucleus where ribosomes are assembled.",
  "CELL MEMBRANE": "A thin, flexible barrier that surrounds the cell and controls the movement of substances in and out of the cell.",
  "GOLGI BODIES": "Organelles that modify, sort, and package proteins and other cellular products for transport within the cell or secretion outside the cell.",
  "ENDOPLASMIC RETICULUM": "A network of membrane-bound sacs and tubules that transport materials throughout the cell. It can be rough (with ribosomes attached) or smooth (without ribosomes).",
  "RIBOSOME": "Tiny organelles that are the sites of protein synthesis.",
  "MITOCHONDRION": "The powerhouse of the cell. It converts energy from food into ATP, which is the cell's main energy currency.",
  "LYSOSOME": "Organelles that contain enzymes that break down waste materials and cellular debris.",
  "VACUOLE": "Storage organelles that can store food, water, waste products, or other substances.",
  "CENTRIOLE": "Cylindrical structures that help organize microtubules during cell division.",
  "MICROTUBULE": "Hollow, rod-shaped structures that help maintain cell shape, aid in cell division, and transport materials throughout the cell.",
  "PHOSPHOLIPIDS": "The main components of the cell membrane, forming a bilayer that creates a barrier between the inside and outside of the cell.",
  "CYTOSOL": "The fluid that fills the cell and contains various organelles and other cellular components.",
  "NUCLEAR ENVELOPE": "Another name for the nuclear membrane.",
  "PHAGOSOMES": "Vesicles that engulf and engulf foreign particles or debris for digestion by lysosomes.",
  "CISTERNAE": "Flattened, stacked sacs that make up the Golgi apparatus.",
  "CELL WALL": "A rigid structure found outside the cell membrane of plant cells, bacteria, fungi, and some other organisms. It provides support and protection.",
  "STROMA": "The fluid-filled space within the chloroplasts where the light-independent reactions of photosynthesis occur.",
  "GRANA": "Stacks of thylakoids found within the chloroplasts.",
  "THYLAKOIDS": "Membrane-bound sacs within the chloroplasts that contain chlorophyll and other pigments involved in photosynthesis.",
  "CHLOROPHYLL": "A green pigment found in plants and some other organisms that absorbs sunlight for photosynthesis.",
  "CHLOROPLAST": "Organelles found in plant cells that are responsible for photosynthesis.",
  "PHOTOSYNTHESIS": "The process by which plants use sunlight, carbon dioxide, and water to produce glucose and oxygen.",
  "LUMEN": "The interior space of a hollow structure, such as the endoplasmic reticulum or the thylakoids.",
  "PROKARYOTES": "Single-celled organisms that lack a nucleus and other membrane-bound organelles.",
  "EUKARYOTES": "Multicellular organisms with a nucleus and other membrane-bound organelles.",
  "CILLIA": "Short, hair-like structures that extend from the cell surface and help the cell to move or capture food.",
  "FLAGELLA": "Long, whip-like structures that extend from the cell surface and help the cell to move.",
  "VILLIA": "Finger-like projections of the cell membrane that increase the surface area for absorption or secretion.",
  "MICROVILLI": "Tiny, finger-like projections of the cell membrane that increase the surface area for absorption or secretion.",
  "DIFFUSION": "The movement of molecules from an area of high concentration to an area of low concentration.",
  "ATP": "Adenosine triphosphate, the main energy currency of cells.",
  "CARRIER PROTEINS": "Proteins that transport specific molecules across the cell membrane.",
  "CHANNEL PROTEINS": "Proteins that form pores in the cell membrane to allow specific molecules to pass through.",
  "OSMOSIS": "The diffusion of water across a semi-permeable membrane.",
  "ISOTONIC": "A solution with the same concentration of solutes as the inside of a cell.",
  "HYPOTONIC": "A solution with a lower concentration of solutes than the inside of a cell.",
  "HYPERTONIC": "A solution with a higher concentration of solutes than the inside of a cell.",
  "ENDOCYTOSIS": "The process by which cells take in substances by engulfing them in a vesicle.",
  "PHAGOCYTOSIS": "A type of endocytosis in which cells engulf solid particles.",
  "PINOCYTOSIS": "A type of endocytosis in which cells engulf liquid droplets.",
  "EXOCYTOSIS": "The process by which cells release substances by fusing vesicles with the cell membrane.",
  "CELL DIVISION": "The process by which cells reproduce.",
  "CELL CYCLE": "The series of events that occur during cell division.",
  "MITOSIS": "A type of cell division that produces two identical daughter cells.",
  "INTERPHASE": "The phase of the cell cycle between cell divisions.",
  "MITOTIC PHASE": "The phase of the cell cycle during which mitosis occurs.",
  "CHROMOSOMES": "Thread-like structures that contain DNA.",
  "DNA": "Deoxyribonucleic acid, the genetic material of cells.",
  "PROPHASE": "The first stage of mitosis, during which the chromosomes become visible and the nuclear envelope breaks down.",
  "METAPHASE": "The second stage of mitosis, during which the chromosomes line up at the equator of the cell.",
  "ANAPHASE": "The third stage of mitosis, during which the sister chromatids of each chromosome are separated and pulled to opposite poles of the cell.",
  "TELOPHASE": "The fourth stage of mitosis, during which the nuclear envelope reforms around each set of chromosomes and the cytoplasm divides.",
  "MITOTIC SPINDLE": "A network of microtubules that helps to separate the chromosomes during mitosis.",
  "KINETOCHORE": "A protein complex that attaches to the centromere of a chromosome and helps to attach it to the mitotic spindle.",
  "ASTER": "A star-shaped arrangement of microtubules that forms around the centrosome during mitosis.",
  "CENTROMERE": "The region of a chromosome where the two sister chromatids are attached.",
  "CENTROSOME": "A region of the cytoplasm that contains the centrioles.",
  "METAPHASE PLATE": "The imaginary plane at the equator of the cell where the chromosomes line up during mitosis.",
  "CYTOKINESIS": "The division of the cytoplasm during cell division.",
  "CLEAVAGE FURROW": "A groove that forms in the cell membrane of animal cells during cytokinesis, eventually pinching the cell in two.",
  "CELL PLATE": "A membrane-bound structure that forms in the middle of plant cells during cytokinesis, eventually dividing the cell in two.",
  "MEIOSIS": "A type of cell division that produces four haploid daughter cells, each with half the number of chromosomes as the original cell.",
  "GAMETES": "Sex cells, such as sperm and eggs.",
  "DIPLOID CELL": "A cell with two sets of chromosomes.",
  "HAPLOID CELL": "A cell with one set of chromosomes.",
  "SISTER CHROMATIDS": "Identical copies of a chromosome that are attached to each other at the centromere.",
  "HOMOLOGOUS CHROMOSOMES": "Pairs of chromosomes that are similar in size and shape and contain genes for the same traits.",
  "ALLELES": "Different versions of a gene.",
  "CROSSING OVER": "The exchange of genetic material between homologous chromosomes during meiosis.",
  "SYNAPTONEMAL COMPLEX": "A protein structure that holds homologous chromosomes together during meiosis."
}