{
  "CELL WALL": "A cell wall is a rigid, protective layer found outside the cell membrane in plant cells, fungi, bacteria, algae, and some archaea.",
  "DNA": "The sequence of these bases encodes genetic information, which determines an organism's traits and functions.",
  "FLAGELLA": "Flagella are long, whip-like structures that extend from the surface of certain cells, enabling them to move.",
  "MITOSIS": "Mitosis is a type of cell division that results in two genetically identical daughter cells from a single parent cell.",
  "CYTOSOL": "Cytosol is the liquid component of the cytoplasm in a cell, where various cellular processes take place.",
  "VACUOLE": "A vacuole is a membrane-bound organelle found in the cytoplasm of plant and fungal cells, as well as some protists and animal cells.",
  "CENTRIOLE": "A centriole is a cylindrical cell structure found in animal cells that plays a crucial role in cell division.",
  "MICROTUBULE": "Microtubules are structural components of the cytoskeleton in eukaryotic cells.",
  "SECRETORY VESICLE": "A secretory vesicle is a small, membrane-bound sac found in cells that stores and transports substances to be secreted from the cell.",
  "CHLOROPHYLL": "Chlorophyll is a green pigment found in plants, algae, and cyanobacteria that is essential for photosynthesis, the process by which plants convert light energy into chemical energy.",
  "ORGANELLE": "An organelle is a specialized structure within a cell that performs a specific function.",
  "NUCLEAR ENVELOPE": "The nuclear envelope is a double membrane structure that surrounds the nucleus in eukaryotic cells.",
  "CISTERNA": "A cistern is a container or tank used to collect and store rainwater or other liquids.",
  "CRISTAE": "Cristae (plural of crista) are folds or projections found in the inner membrane of mitochondria.",
  "PROTEIN": "Proteins are large, complex molecules made up of chains of amino acids.",
  "LIPIDS": "Lipids are a diverse group of organic compounds that are insoluble in water but soluble in nonpolar solvents like fats and oils.",
  "CILIA": "Cilia are tiny, hair-like structures on the surface of many cells."
}